# import pygame
# pygame.SRCALPHA

# ==================== MÀU CƠ BẢN ====================
WHITE       = (255, 255, 255)
BLACK       = (0, 0, 0)
RED         = (255, 0, 0)
GREEN       = (0, 255, 0)
BLUE        = (0, 0, 255)
YELLOW      = (255, 255, 0)
CYAN        = (0, 255, 255)
MAGENTA     = (255, 0, 255)
ORANGE      = (230, 190, 40)
PINK        = (255, 100, 150)
TEAL        = (100, 255, 255)

# ==================== MÀU TỐI (DARK) ====================
DARK_RED    = (150, 0, 0)
DARK_GREEN  = (0, 150, 0)
DARK_BLUE   = (0, 0, 150)
DARK_GRAY   = (40, 40, 40)

# ==================== MÀU SÁNG (LIGHT) ====================
LIGHT_RED   = (255, 100, 100)
LIGHT_GREEN = (100, 255, 100)
LIGHT_BLUE  = (100, 100, 255)
LIGHT_GRAY  = (200, 200, 200)

# ==================== MÀU ĐẶC BIỆT ====================
GOLD        = (255, 215, 0)
LIGHT_GRAY      = (192, 192, 192)
BROWN       = (139, 69, 19)
PURPLE      = (128, 0, 128)
NAVY        = (0, 0, 128)

# ==================== MÀU CÓ OPACITY (RGBA) ====================
WHITE_A     = (255, 255, 255, 200)
BLACK_A     = (0, 0, 0, 200)
RED_A       = (255, 0, 0, 200)
GREEN_A     = (0, 255, 0, 200)
BLUE_A      = (0, 0, 255, 200)
YELLOW_A    = (255, 255, 0, 200)
CYAN_A      = (0, 255, 255, 200)
MAGENTA_A   = (255, 0, 255, 200)
ORANGE_A    = (230, 190, 40, 200)
PINK_A      = (255, 100, 150, 200)
TEAL_A      = (100, 255, 255, 200)
GRAY_A      = (128, 128, 128, 200)
TRANSPARENT = (0, 0, 0, 0)  # hoàn toàn trong suốt
